SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
/**************************************************************************
 *  SMART DUSTBIN - INDUSTRY ORIENTED EMBEDDED SYSTEM
 *  ESP32 firmware  |  Wi-Fi + REST API  |  Firmware v2.0.0-wifi
 *  ------------------------------------------------------------------------
 *  THIS IS THE PRIMARY BUILD FOR THIS PROJECT.
 *  The Arduino UNO version in 04_smart_dustbin_complete has identical
 *  sensing and control logic, but no networking.
 *
 *  THREE ULTRASONIC SENSORS
 *    #1 HAND    - OUTSIDE, on the front face, looking outward.
 *                 A hand within 25 cm makes the servo lift the lid.
 *    #2 LEVEL A - INSIDE the bin, under the lid, front-left diagonal.
 *    #3 LEVEL B - INSIDE the bin, under the lid, rear-right diagonal.
 *
 *  WHY TWO SENSORS INSIDE THE BIN?
 *    Rubbish is never flat. A single downward sensor over a peak reports
 *    "full" while the bin is half empty; one over a hollow reports the
 *    opposite. Two sensors on opposite diagonals give:
 *      1. ACCURACY   - averaging two points beats trusting one.
 *      2. REDUNDANCY - one dies, the bin keeps working on the other.
 *      3. DIAGNOSIS  - a big A-vs-B gap means the load is piled to one side.
 *
 *  FULL-BIN LOCKDOWN
 *    A bin at FULL refuses to open for a hand. Letting one more person push
 *    rubbish into a full bin is exactly how bins overflow onto the street,
 *    so the lid stays shut, the red LED stays on, and each refused approach
 *    is counted. Two things still open it:
 *      - the safety re-open (a hand returning while the lid comes down),
 *        because a lid must never close on somebody's hand, and
 *      - the operator's OPEN command - the crew override used to empty it.
 *    Emptying the bin drops it below FULL, which releases the lock.
 *    website/assets/js/sim.js mirrors this logic line for line.
 *
 *  WHAT THE ESP32 ADDS OVER THE UNO
 *    - joins Wi-Fi and serves a built-in status page
 *    - GET /api/status            -> live JSON telemetry
 *    - GET /api/command?cmd=OPEN  -> genuine remote control
 *    - the admin dashboard in website/ can drive a real board
 *    - OPTIONAL CLOUD SYNC: with a secrets.h next to this file, the board
 *      reports into Firestore bins/<DEVICE_ID> and obeys commands queued
 *      from any dashboard, anywhere - no browser ever talks to the board.
 *      A FreeRTOS task on core 0 does all of that networking, so loop()
 *      on core 1 never waits for the internet (see CLOUD SYNC below).
 *
 *  LIBRARIES (Library Manager)
 *    ESP32Servo         by Kevin Harrington
 *    LiquidCrystal I2C  by Frank de Brabander   (only if USE_LCD is on)
 *    (HTTPClient and WiFiClientSecure used by cloud sync ship with the core)
 *
 *  BOARD SETTINGS
 *    Tools > Board > ESP32 Dev Module
 *    Tools > Upload Speed > 115200
 *
 *  WIRING (3.3 V logic!)
 *    HC-SR04 #1 (hand)     TRIG GPIO5   ECHO GPIO18   VCC 5V(VIN)  GND GND
 *    HC-SR04 #2 (level A)  TRIG GPIO19  ECHO GPIO23   VCC 5V(VIN)  GND GND
 *    HC-SR04 #3 (level B)  TRIG GPIO32  ECHO GPIO33   VCC 5V(VIN)  GND GND
 *    Servo SG90            SIGNAL GPIO13   V+ 5V(VIN)   GND GND
 *    Buzzer                GPIO25
 *    Green LED             GPIO26 - 220R - LED - GND
 *    Red LED               GPIO27 - 220R - LED - GND
 *    LCD 16x2 I2C          SDA GPIO21  SCL GPIO22  VCC 5V  GND GND
 *
 *  IMPORTANT SAFETY NOTE FOR REAL HARDWARE
 *    The HC-SR04 ECHO pin outputs 5 V but ESP32 GPIOs are 3.3 V only.
 *    Put a divider on EACH of the three ECHO lines:
 *        ECHO --[1k]--+--[2k]-- GND        take the ESP32 signal from +
 *    Skipping this works on the bench and slowly destroys the chip.
 *    (In the Wokwi simulator there is nothing to damage, so the divider is
 *     omitted from the simulation diagram for clarity.)
 *
 *  SERIAL COMMANDS (Serial Monitor at 115200 baud, line ending = Newline)
 *    OPEN CLOSE AUTO MUTE UNMUTE EMPTY PING STATUS WIFI CLOUD HELP
 **************************************************************************/

/* ======================================================================
 *  BUILD OPTIONS
 *  Comment out USE_LCD if you have no I2C display - everything else keeps
 *  working and the display code disappears from the build entirely.
 * ==================================================================== */
#define USE_LCD

#include <WiFi.h>
#include <WebServer.h>
#include <ESP32Servo.h>
#ifdef USE_LCD
  #include <Wire.h>
  #include <LiquidCrystal_I2C.h>
  LiquidCrystal_I2C lcd(0x27, 16, 2);   /* try 0x3F if the screen is blank */
#endif

/* ======================================================================
 *  CLOUD SYNC SWITCH
 *  Cloud sync turns itself ON when a file called secrets.h sits next to
 *  this sketch, and OFF when it does not - no #define to forget. secrets.h
 *  holds the board's own Firebase login and is listed in .gitignore, so it
 *  can never be pushed to GitHub. Copy secrets.example.h to start.
 *  (__has_include is a standard C++17 preprocessor test, supported by the
 *  GCC that ships with the ESP32 core.)
 * ==================================================================== */
#if __has_include("secrets.h")
  #include "secrets.h"
  #define CLOUD_SYNC 1
  #if !defined(DEVICE_EMAIL) || !defined(DEVICE_PASSWORD)
    #error "secrets.h must #define DEVICE_EMAIL and DEVICE_PASSWORD - see secrets.example.h"
  #endif
#else
  #define CLOUD_SYNC 0
#endif

#if CLOUD_SYNC
  #include <WiFiClientSecure.h>
  #include <HTTPClient.h>
  /* The Mozilla root-certificate bundle compiled into the ESP32 core. With it
     the TLS layer checks that it really is talking to Google - the only
     thing that makes sending a password over the network safe. It costs
     about 66 KB of flash, which is why it is only linked when sync is on. */
  extern const uint8_t x509_crt_imported_bundle_bin_start[] asm("_binary_x509_crt_bundle_start");
  extern const uint8_t x509_crt_imported_bundle_bin_end[]   asm("_binary_x509_crt_bundle_end");
#endif

/* ======================================================================
 *  WI-FI CREDENTIALS
 *  For the Wokwi simulator leave these exactly as they are - "Wokwi-GUEST"
 *  with an empty password is the simulator's built-in network.
 *  For real hardware put your own SSID and password here, and blank them
 *  again before you commit the file to a public repository.
 * ==================================================================== */
const char* WIFI_SSID = "Wokwi-GUEST";
const char* WIFI_PASS = "";

/* ======================================================================
 *  1. PIN MAP (ESP32)
 * ==================================================================== */
const int PIN_TRIG_HAND    = 5;
const int PIN_ECHO_HAND    = 18;
const int PIN_TRIG_LEVEL_A = 19;
const int PIN_ECHO_LEVEL_A = 23;
const int PIN_TRIG_LEVEL_B = 32;
const int PIN_ECHO_LEVEL_B = 33;
const int PIN_SERVO        = 13;
const int PIN_BUZZER       = 25;
const int PIN_LED_GREEN    = 26;
const int PIN_LED_RED      = 27;

/* ======================================================================
 *  2. CONFIGURATION - every tunable number lives here
 * ==================================================================== */
const char*  DEVICE_ID  = "BIN-001";
const char*  FIRMWARE_V = "2.0.0-wifi";
const char*  ZONE       = "Central Zone";

