SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
const float  BIN_HEIGHT_CM      = 30.0;   /* sensor face to empty floor */
const float  HAND_DETECT_CM     = 25.0;   /* closer than this, open     */
const float  LEVEL_WARN_PERCENT = 75.0;
const float  LEVEL_FULL_PERCENT = 90.0;
const float  LEVEL_DISAGREE_PCT = 25.0;   /* A vs B gap = uneven load   */

const int    ANGLE_CLOSED = 0;
const int    ANGLE_OPEN   = 90;

const unsigned long LID_OPEN_HOLD_MS = 3000;
const unsigned long LID_TRAVEL_MS    = 400;
const unsigned long LID_SAMPLE_MS    = 60;
const unsigned long LEVEL_SAMPLE_MS  = 1000;
const unsigned long TELEMETRY_MS     = 2000;
const unsigned long BEEP_ON_MS       = 200;
const unsigned long BEEP_OFF_MS      = 1800;
const unsigned long SENSOR_SETTLE_MS = 12;    /* anti-crosstalk gap */
const unsigned long ECHO_TIMEOUT_US  = 25000;
const float         INVALID          = -1.0;

/* ======================================================================
 *  2b. CLOUD SYNC TUNING (only used when secrets.h exists)
 *  The Firebase apiKey and project id are PUBLIC by design - the very same
 *  values are in website/assets/js/firebase-config.js. They only say WHICH
 *  project to talk to. What protects the data is the board's password (in
 *  secrets.h) plus the Firestore rules, which let this board's account
 *  write nothing but the "device" and "commandAck" fields of its own bin.
 *
 *  QUOTA MATHS - the Firestore free tier is 20,000 writes and 50,000 reads
 *  per day for the WHOLE project:
 *    polling every 10 s          = 8,640 reads/day per board
 *    heartbeat every 60 s        = 1,440 writes/day for a quiet bin
 *    worst case, a change every 5 s = 17,280 writes/day
 *  So one board fits comfortably, a handful fit for a demo, and a real
 *  fleet would lengthen these intervals or move to MQTT.
 * ==================================================================== */
const char* FIREBASE_API_KEY = "AIzaSyDR7IGdS2Br7u_2iLALcS3hgRCiDFtZtGI";
const char* FIREBASE_PROJECT = "sdbs-399da";

const unsigned long CLOUD_MIN_PUSH_MS    = 5000;    /* never report faster than this */
const unsigned long CLOUD_HEARTBEAT_MS   = 60000;   /* report even if nothing moved  */
const unsigned long CLOUD_POLL_MS        = 10000;   /* look for a queued command     */
const unsigned long CLOUD_TOKEN_SLACK_MS = 300000;  /* refresh with 5 min to spare   */
const int           CLOUD_FILL_STEP      = 1;       /* fill change (%) worth a push  */
const uint32_t      CLOUD_TASK_STACK     = 12288;   /* bytes - TLS needs a deep stack */

/* ======================================================================
 *  3. TYPES AND GLOBAL STATE
 * ==================================================================== */
enum LidState  { LID_CLOSED, LID_OPENING, LID_OPEN, LID_CLOSING };
enum BinStatus { BIN_OK, BIN_WARNING, BIN_FULL, BIN_ERROR };

WebServer server(80);
Servo     lidServo;

LidState  lidState  = LID_CLOSED;
BinStatus binStatus = BIN_OK;

float   handDistance = INVALID;
float   distA        = INVALID;   /* raw cm from level sensor A */
float   distB        = INVALID;   /* raw cm from level sensor B */
float   fillA        = INVALID;   /* percentage seen by A       */
float   fillB        = INVALID;   /* percentage seen by B       */
float   fillPercent  = 0.0;       /* the fused value            */
float   fillSpread   = 0.0;       /* |fillA - fillB|            */
bool    unevenLoad   = false;
uint8_t validSensors = 0;         /* 2 healthy, 1 degraded, 0 failed */

unsigned long stateEnteredAt = 0, lastSeenHandAt = 0;
unsigned int  openCount = 0, errorCount = 0;
unsigned int  refusedCount   = 0;      /* approaches turned away while locked */
bool          refusalLatched = false;  /* one refusal per approach, not per poll */
bool          buzzerEnabled = true, buzzerOn = false, manualOverride = false;
unsigned long buzzerChanged = 0, blinkChanged = 0;
bool          blinkOn = false;
unsigned long tLid = 0, tLevel = 0, tTelem = 0;

#if CLOUD_SYNC
/* ----------------------------------------------------------------------
 *  3a. STATE SHARED BETWEEN THE TWO CPU CORES
 *  loop() runs on core 1, the cloud task on core 0 - truly at the same
 *  time, not taking turns. Two rules keep that safe:
 *    1. Structs that both cores touch are copied whole inside a critical
 *       section (portENTER_CRITICAL), so neither core can ever read a
 *       half-written struct. Plain values only - no String, no pointers -
 *       so a struct assignment is a complete copy.
 *    2. Commands and acknowledgements travel through FreeRTOS queues,
 *       which are thread-safe by design: one core posts, the other
 *       collects when it is ready, nobody waits.
 * -------------------------------------------------------------------- */
struct CloudSnapshot {           /* loop() -> task, once per telemetry tick */
  int  fill, fillA, fillB, opens, refused, errors, sensors, rssi;
  bool locked;
  char lid[8];                   /* "CLOSING" + NUL      */
  char status[13];               /* "SENSOR_ERROR" + NUL */
  bool valid;                    /* false until loop() has published once */
};
struct CloudCommand {            /* task -> loop() through cloudCmdQueue */
  char cmd[8];
  char id[41];
};
struct CloudAck {                /* loop() -> task through cloudAckQueue */
  char id[41];
  char result[48];
};
struct CloudStatus {             /* task -> the CLOUD serial command */
  bool          signedIn;
  int           lastHttp;        /* last HTTP status, negative = network error */
  unsigned long lastPushAt;      /* millis() of the last good report, 0 = never */
  uint32_t      pushes, polls;
  uint32_t      stackFree;       /* task stack never used so far, bytes */
  char          lastCmdId[41];
  char          uid[40];
};

portMUX_TYPE  cloudMux      = portMUX_INITIALIZER_UNLOCKED;  /* guards the two below */
CloudSnapshot cloudSnap;         /* written by loop(), read by the task   */
CloudStatus   cloudStat;         /* written by the task, read by loop()   */
QueueHandle_t cloudCmdQueue = NULL;
QueueHandle_t cloudAckQueue = NULL;
#endif

/* ======================================================================
 *  3b. FUNCTION PROTOTYPES
 * ==================================================================== */
void   taskHandDetection(unsigned long now);
void   taskBinLevel(void);
void   taskAlerts(unsigned long now);
void   taskDisplay(void);
void   taskTelemetry(unsigned long now);
void   updateLidStateMachine(bool handDetected, unsigned long now);
void   enterLidState(LidState s, unsigned long now);
bool   lidIsOpen(void);
bool   binLocked(void);
const char* lidStateName(void);
const char* binStatusName(void);
float  calculateFillPercent(float d);
int    pctToInt(float v);
void   fuseLevelSensors(float dA, float dB);
float  readDistanceCm(int trigPin, int echoPin);
float  readDistanceMedian(int trigPin, int echoPin);
bool   blinkPhase(unsigned long now, unsigned long periodMs);
void   printBar(float percent);
String buildStatusJson(void);
String applyCommand(String cmd);
void   handleSerialCommands(void);
void   handleRoot(void);
void   handleStatus(void);
void   handleCommand(void);
void   connectWifi(void);
void   banner(void);
void   selfTest(void);
void   cloudBegin(void);
void   cloudServiceLoop(void);
void   cloudPublishSnapshot(void);
void   cloudPrintStatus(void);
const char* cloudStateText(void);
#if CLOUD_SYNC
void   cloudTask(void* arg);
bool   cloudEnsureToken(void);
bool   cloudSignIn(void);
bool   cloudRefresh(void);
bool   cloudCommit(const CloudSnapshot& s, const CloudAck* ack);
void   cloudPoll(void);
int    cloudHttp(const char* method, const String& url, const String& body,
                 const char* contentType, bool withToken, String& reply);
int    cloudFirestore(const char* method, const String& url, const String& body,
                      String& reply);
void   cloudNoteHttp(int code, const String& reply);
String cloudDocName(void);
String jsonStringValue(const String& body, const char* key, int from);
String firestoreString(const String& body, const char* key, int from);
String jsonEscape(const char* s);
String fsInt(const char* key, int v);
String fsStr(const char* key, const char* v);
String fsBool(const char* key, bool v);
bool   cloudIdIsSafe(const String& id);
bool   cloudCmdAllowed(const String& cmd);
#endif

/* ======================================================================
 *  4. SETUP
 * ==================================================================== */
void setup() {
  Serial.begin(115200);
  delay(200);

  /* readStringUntil() waits for a newline, and gives up after this long.
     The default is a full SECOND - so a half-typed command would freeze
     loop(), and with it the lid, for a second. 20 ms is far longer than
     the gap between characters at 115200 baud, and invisible to the lid. */
  Serial.setTimeout(20);

  pinMode(PIN_TRIG_HAND,    OUTPUT);  pinMode(PIN_ECHO_HAND,    INPUT);
  pinMode(PIN_TRIG_LEVEL_A, OUTPUT);  pinMode(PIN_ECHO_LEVEL_A, INPUT);
  pinMode(PIN_TRIG_LEVEL_B, OUTPUT);  pinMode(PIN_ECHO_LEVEL_B, INPUT);
  pinMode(PIN_BUZZER,    OUTPUT);
  pinMode(PIN_LED_GREEN, OUTPUT);
  pinMode(PIN_LED_RED,   OUTPUT);

  lidServo.setPeriodHertz(50);            /* standard 50 Hz servo    */
  lidServo.attach(PIN_SERVO, 500, 2400);  /* min and max pulse, us   */
  lidServo.write(ANGLE_CLOSED);           /* boot into a safe state  */

#ifdef USE_LCD
  Wire.begin(21, 22);
  lcd.init();
  lcd.backlight();
  lcd.setCursor(0, 0); lcd.print("Smart Dustbin");
  lcd.setCursor(0, 1); lcd.print(DEVICE_ID);
#endif

  banner();
  selfTest();
  connectWifi();

  /* REST endpoints consumed by the admin dashboard */
  server.on("/",            handleRoot);
  server.on("/api/status",  handleStatus);
  server.on("/api/command", handleCommand);
  server.begin();
  Serial.println(F("HTTP server started on port 80"));

