SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  cloudBegin();                   /* starts the core-0 task, or says why not */

  stateEnteredAt = millis();
  Serial.println(F("System running. Type HELP for commands."));
  Serial.println();
}

/* ======================================================================
 *  5. LOOP - the cooperative scheduler
 *  Each task asks the clock whether its turn has come. Nothing blocks,
 *  so the loop runs thousands of times per second and Wi-Fi requests are
 *  answered promptly even while the lid is moving.
 *  The slow part - HTTPS to the cloud, 0.5 to 2 s per request - is not in
 *  here at all: it lives in its own FreeRTOS task on the other core.
 * ==================================================================== */
void loop() {
  unsigned long now = millis();

  server.handleClient();          /* answer any pending web request */
  handleSerialCommands();
  cloudServiceLoop();             /* run commands queued from the cloud */

  if (now - tLid   >= LID_SAMPLE_MS)   { tLid   = now; taskHandDetection(now); }
  if (now - tLevel >= LEVEL_SAMPLE_MS) { tLevel = now; taskBinLevel();         }
  if (now - tTelem >= TELEMETRY_MS)    { tTelem = now; taskTelemetry(now);     }

  taskAlerts(now);
  taskDisplay();
}

/* ======================================================================
 *  WI-FI
 * ==================================================================== */
void connectWifi() {
  Serial.print(F("Connecting to Wi-Fi"));
  WiFi.mode(WIFI_STA);
  /* Wokwi's network is always on channel 6; naming it skips a 4 s scan of
     every channel. Channel 0 means "scan them all", which real routers need. */
  bool wokwi = (strcmp(WIFI_SSID, "Wokwi-GUEST") == 0);
  WiFi.begin(WIFI_SSID, WIFI_PASS, wokwi ? 6 : 0);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 20000) {
    delay(300);
    Serial.print(F("."));
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    Serial.print(F("Connected. Dashboard URL: http://"));
    Serial.println(WiFi.localIP());
    Serial.print(F("Status endpoint:          http://"));
    Serial.print(WiFi.localIP());
    Serial.println(F("/api/status"));
#ifdef USE_LCD
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("WiFi connected");
    lcd.setCursor(0, 1); lcd.print(WiFi.localIP());
    delay(1500);
    lcd.clear();
#endif
  } else {
    Serial.println(F("Wi-Fi FAILED - the bin keeps working offline."));
  }
}

/* ======================================================================
 *  HTTP HANDLERS
 * ==================================================================== */
void handleStatus() {
  /* CORS header so the dashboard, served from a different origin, is
     allowed to READ this response from JavaScript. Without it the browser
     fetches the data and then refuses to hand it to the page, which looks
     exactly like a network failure and is not. */
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(200, "application/json", buildStatusJson());
}

void handleCommand() {
  server.sendHeader("Access-Control-Allow-Origin", "*");

  if (!server.hasArg("cmd")) {
    server.send(400, "application/json",
                "{\"ok\":false,\"error\":\"missing cmd parameter\"}");
    return;
  }

  String cmd = server.arg("cmd");
  cmd.trim();
  cmd.toUpperCase();

  String result = applyCommand(cmd);
  bool   known  = (result != "unknown command");

  Serial.print(F("HTTP command: ")); Serial.print(cmd);
  Serial.print(F(" -> ")); Serial.println(result);

  /* This JSON is assembled by hand, so ONLY fixed words may enter it.
     `cmd` arrives from the query string and anybody can put a quote or a
     backslash in it - echoing that back would close the string early and
     hand the caller a broken (or forged) reply. So an unrecognised command
     is reported as the constant "unknown"; it is never echoed. `result` is
     always one of applyCommand()'s own literals, so it is safe as it is. */
  String body = String("{\"ok\":") + (known ? "true" : "false") +
                ",\"command\":\"" + (known ? cmd : String("unknown")) +
                "\",\"result\":\"" + result + "\"}";
  server.send(200, "application/json", body);
}

void handleRoot() {
  String html = "<!doctype html><meta name=viewport content='width=device-width'>";
  html += "<style>body{font-family:-apple-system,system-ui,sans-serif;";
  html += "background:#fff;color:#1d1d1f;padding:32px;max-width:640px;margin:auto}";
  html += "a{color:#0071e3;text-decoration:none}h2{letter-spacing:-.5px}";
  html += "b{font-variant-numeric:tabular-nums}";
  html += ".p{background:#f5f5f7;border-radius:18px;padding:16px 20px;margin:12px 0}";
  html += "</style><h2>Smart Dustbin ";
  html += DEVICE_ID;
  html += "</h2><div class=p>Fill: <b>" + String((int)fillPercent) + "%</b>";
  html += " &nbsp; (A " + String((int)fillA) + "% / B " + String((int)fillB) + "%)<br>";
  html += "Status: <b>" + String(binStatusName()) + "</b><br>";
  html += "Lid: <b>" + String(lidStateName()) + "</b><br>";
  html += "Sensors live: <b>" + String((int)validSensors) + " / 2</b><br>";
  html += "Cloud sync: <b>" + String(cloudStateText()) + "</b>";
  if (binLocked()) {
    html += "<br><b style='color:#ff3b30'>LOCKED - FULL</b> (hands refused: ";
    html += String(refusedCount) + ", crew override: OPEN)";
  }
  if (unevenLoad) html += "<br><b style='color:#ff9500'>UNEVEN LOAD</b>";
  html += "</div><div class=p><a href='/api/status'>/api/status</a> &nbsp;|&nbsp; ";
  html += "<a href='/api/command?cmd=OPEN'>OPEN</a> &nbsp;|&nbsp; ";
  html += "<a href='/api/command?cmd=CLOSE'>CLOSE</a> &nbsp;|&nbsp; ";
  html += "<a href='/api/command?cmd=AUTO'>AUTO</a> &nbsp;|&nbsp; ";
  html += "<a href='/api/command?cmd=EMPTY'>EMPTY</a></div>";
  server.send(200, "text/html", html);
}

/* ======================================================================
 *  JSON TELEMETRY
 * ==================================================================== */
String buildStatusJson() {
  String j = "{";
  j += "\"id\":\""       + String(DEVICE_ID)  + "\",";
  j += "\"zone\":\""     + String(ZONE)       + "\",";
  j += "\"firmware\":\"" + String(FIRMWARE_V) + "\",";
  j += "\"fill\":"       + String(pctToInt(fillPercent)) + ",";
  j += "\"fillA\":"      + String(pctToInt(fillA)) + ",";
  j += "\"fillB\":"      + String(pctToInt(fillB)) + ",";
  j += "\"spread\":"     + String(pctToInt(fillSpread)) + ",";
  j += "\"uneven\":"     + String(unevenLoad ? "true" : "false") + ",";
  j += "\"sensors\":"    + String((int)validSensors) + ",";
  j += "\"distanceA\":"  + String(distA, 1) + ",";
  j += "\"distanceB\":"  + String(distB, 1) + ",";
  j += "\"lid\":\""      + String(lidStateName())  + "\",";
  j += "\"status\":\""   + String(binStatusName()) + "\",";
  j += "\"locked\":"     + String(binLocked() ? "true" : "false") + ",";
  j += "\"opens\":"      + String(openCount)  + ",";
  j += "\"refused\":"    + String(refusedCount) + ",";
  j += "\"errors\":"     + String(errorCount) + ",";
  j += "\"muted\":"      + String(buzzerEnabled ? "false" : "true") + ",";
  j += "\"manual\":"     + String(manualOverride ? "true" : "false") + ",";
  j += "\"rssi\":"       + String((int)WiFi.RSSI()) + ",";
  j += "\"uptime\":"     + String(millis() / 1000);
  j += "}";
  return j;
}

/* ======================================================================
 *  COMMANDS - one implementation, reached from Wi-Fi, serial AND the cloud
 *  OPEN is also the crew override: it opens a locked (FULL) bin, and the
 *  reply says so, so nobody mistakes it for the lockdown failing.
 * ==================================================================== */
String applyCommand(String cmd) {
  cmd.trim();
  cmd.toUpperCase();

