SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  if (cmd == "OPEN")   { manualOverride = true;  lidServo.write(ANGLE_OPEN);
                         enterLidState(LID_OPEN, millis());
                         return binLocked() ? "lid forced open (crew override - bin FULL)"
                                            : "lid forced open"; }
  if (cmd == "CLOSE")  { manualOverride = true;  lidServo.write(ANGLE_CLOSED);
                         enterLidState(LID_CLOSED, millis()); return "lid forced closed"; }
  if (cmd == "AUTO")   { manualOverride = false;              return "automatic mode"; }
  if (cmd == "MUTE")   { buzzerEnabled = false; buzzerOn = false;
                         digitalWrite(PIN_BUZZER, LOW);       return "buzzer muted"; }
  if (cmd == "UNMUTE") { buzzerEnabled = true;                return "buzzer enabled"; }
  if (cmd == "EMPTY")  { fillPercent = 0; fillA = 0; fillB = 0; fillSpread = 0;
                         unevenLoad = false; binStatus = BIN_OK; openCount = 0;
                         refusedCount = 0;      /* BIN_OK also releases the lock */
                         return "bin marked collected, counters reset"; }
  if (cmd == "PING")   {                                      return "pong - device online"; }
  return "unknown command";
}

void handleSerialCommands() {
  if (!Serial.available()) return;

  String cmd = Serial.readStringUntil(10);   /* 10 = newline character */
  cmd.trim();
  cmd.toUpperCase();
  if (cmd.length() == 0) return;

  if (cmd == "STATUS") { taskTelemetry(millis()); return; }

  if (cmd == "WIFI") {
    Serial.print(F("SSID: ")); Serial.println(WIFI_SSID);
    Serial.print(F("State: "));
    if (WiFi.status() == WL_CONNECTED) {
      Serial.print(F("connected, IP http://")); Serial.print(WiFi.localIP());
      Serial.print(F(", RSSI ")); Serial.println(WiFi.RSSI());
    } else {
      Serial.println(F("not connected"));
    }
    return;
  }

  if (cmd == "CLOUD") { cloudPrintStatus(); return; }

  if (cmd == "HELP") {
    Serial.println(F("Commands: OPEN CLOSE AUTO MUTE UNMUTE EMPTY PING STATUS WIFI CLOUD HELP"));
    return;
  }

  String result = applyCommand(cmd);
  if (result == "unknown command") {
    Serial.print(F("ERR: unknown command - type HELP. Received: "));
    Serial.println(cmd);
  } else {
    Serial.print(F("ACK: ")); Serial.println(result);
  }
}

/* ======================================================================
 *  TASK 1 - HAND DETECTION AND LID CONTROL
 * ==================================================================== */
void taskHandDetection(unsigned long now) {
  handDistance = readDistanceCm(PIN_TRIG_HAND, PIN_ECHO_HAND);

  bool handDetected = (handDistance != INVALID) &&
                      (handDistance <= HAND_DETECT_CM);

  if (manualOverride) return;    /* the operator is in control right now */

  updateLidStateMachine(handDetected, now);
}

/**************************************************************************
 *  updateLidStateMachine()
 *
 *        hand seen AND locked:
 *        stay shut, count ONE refusal
 *        per approach
 *          +-----+
 *          |     |
 *          |     v
 *      +----------+  hand seen AND  +-----------+  travel done  +--------+
 *      |  CLOSED  |---------------->|  OPENING  |-------------->|  OPEN  |
 *      +----------+   NOT locked    +-----------+               +--------+
 *           ^                             ^                          |
 *           | travel done                 | hand returns             | no hand
 *           |                             | (even when FULL)         | for 3 s
 *      +----------+                       |                          |
 *      | CLOSING  |<----------------------+--------------------------+
 *      +----------+
 *
 *      locked = (binStatus == FULL)        see binLocked()
 *
 *  The CLOSING to OPENING edge is a safety feature: a hand returning while
 *  the lid is coming down re-opens it immediately - even on a bin that
 *  turned FULL meanwhile. Safety beats lockdown. The operator's OPEN
 *  command bypasses this machine entirely (manualOverride).
 **************************************************************************/
void updateLidStateMachine(bool handDetected, unsigned long now) {
  if (handDetected) lastSeenHandAt = now;
  else              refusalLatched = false;   /* hand gone: next approach counts */

  switch (lidState) {
    case LID_CLOSED:
      if (handDetected && binLocked()) {
        /* The sensor polls every 60 ms, so without the latch one person
           standing there would be counted - and printed - 16 times a second. */
        if (!refusalLatched) {
          refusalLatched = true;
          refusedCount++;
          Serial.println(F("### Bin FULL - lid locked until it is emptied"));
        }
      } else if (handDetected) {
        lidServo.write(ANGLE_OPEN); openCount++;
        enterLidState(LID_OPENING, now);
        Serial.println(F(">>> Hand detected - opening lid"));
      }
      break;

    case LID_OPENING:
      if (now - stateEnteredAt >= LID_TRAVEL_MS) enterLidState(LID_OPEN, now);
      break;

    case LID_OPEN:
      if (now - lastSeenHandAt >= LID_OPEN_HOLD_MS) {
        lidServo.write(ANGLE_CLOSED);
        enterLidState(LID_CLOSING, now);
        Serial.println(F("<<< Area clear - closing lid"));
      }
      break;

    case LID_CLOSING:
      /* Safety beats lockdown: even if the bin turned FULL while the lid
         was coming down, a returning hand re-opens it. */
      if (handDetected) {                       /* safety re-open */
        lidServo.write(ANGLE_OPEN);
        enterLidState(LID_OPENING, now);
        Serial.println(F("!!! Hand returned - re-opening"));
      } else if (now - stateEnteredAt >= LID_TRAVEL_MS) {
        enterLidState(LID_CLOSED, now);
      }
      break;
  }
}

void enterLidState(LidState s, unsigned long now) { lidState = s; stateEnteredAt = now; }
bool lidIsOpen() { return (lidState == LID_OPEN || lidState == LID_OPENING); }

/**************************************************************************
 *  binLocked() - the whole lockdown policy is this one line
 *  SENSOR_ERROR deliberately does not lock: when the level is unknown,
 *  stranding every user would be worse than an occasional overfill.
 **************************************************************************/
bool binLocked() { return binStatus == BIN_FULL; }

const char* lidStateName() {
  switch (lidState) {
    case LID_CLOSED:  return "CLOSED";
    case LID_OPENING: return "OPENING";
    case LID_OPEN:    return "OPEN";
    case LID_CLOSING: return "CLOSING";
  }
  return "UNKNOWN";
}

/* ======================================================================
 *  TASK 2 - WASTE LEVEL FROM THE TWO IN-BIN SENSORS
 *  Skipped while the lid is open, because with the lid up both sensors see
 *  the sky or the arm of the user instead of the rubbish.
 * ==================================================================== */
void taskBinLevel() {
  if (lidIsOpen()) return;

  distA = readDistanceMedian(PIN_TRIG_LEVEL_A, PIN_ECHO_LEVEL_A);
  delay(SENSOR_SETTLE_MS);         /* let A's echoes die before B fires */
  distB = readDistanceMedian(PIN_TRIG_LEVEL_B, PIN_ECHO_LEVEL_B);

  fuseLevelSensors(distA, distB);

  if      (validSensors == 0)                 { errorCount++; binStatus = BIN_ERROR; }
  else if (fillPercent >= LEVEL_FULL_PERCENT) binStatus = BIN_FULL;
  else if (fillPercent >= LEVEL_WARN_PERCENT) binStatus = BIN_WARNING;
  else                                        binStatus = BIN_OK;
}

/**************************************************************************
 *  calculateFillPercent()   - one sensor, pure maths
 *      30.0 cm ->   0 %      22.5 cm ->  25 %
 *      15.0 cm ->  50 %       7.5 cm ->  75 %
 *       3.0 cm ->  90 %       0.0 cm -> 100 %
 **************************************************************************/
float calculateFillPercent(float d) {
  if (d < 0) return INVALID;          /* the "no echo" sentinel */
  if (d > BIN_HEIGHT_CM) d = BIN_HEIGHT_CM;

  float pct = ((BIN_HEIGHT_CM - d) / BIN_HEIGHT_CM) * 100.0;
  if (pct < 0)   pct = 0;
  if (pct > 100) pct = 100;
  return pct;
}

/**************************************************************************
 *  pctToInt()
 *  Rounds a percentage for the wire, the way the JavaScript twin's
 *  Math.round() does - so a bin reading 72.6 % is "73" on the serial line,
 *  in the JSON and on the dashboard, not 72 in one place and 73 in another.
 *
 *  The -1 "no echo" sentinel is passed straight through. Plain
 *  (int)(v + 0.5) would turn -1.0 into 0, quietly reporting "this sensor
 *  says the bin is empty" when what happened is "this sensor said nothing".
 **************************************************************************/
int pctToInt(float v) { return (v < 0) ? -1 : (int)(v + 0.5); }

/**************************************************************************
 *  fuseLevelSensors()
 *    Both valid -> average, and flag a large disagreement as uneven.
 *    One valid  -> keep working in a clearly degraded mode.
 *    Neither    -> report failure rather than inventing a number.
 **************************************************************************/
void fuseLevelSensors(float dA, float dB) {
  fillA = calculateFillPercent(dA);
  fillB = calculateFillPercent(dB);

