SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  bool aOk = (fillA != INVALID);
  bool bOk = (fillB != INVALID);

  fillSpread = 0.0;
  unevenLoad = false;

  if (aOk && bOk) {
    validSensors = 2;
    fillPercent  = (fillA + fillB) / 2.0;
    fillSpread   = fabs(fillA - fillB);
    unevenLoad   = (fillSpread > LEVEL_DISAGREE_PCT);
  } else if (aOk) {
    validSensors = 1; fillPercent = fillA;
  } else if (bOk) {
    validSensors = 1; fillPercent = fillB;
  } else {
    validSensors = 0;   /* keep the last known fillPercent */
  }
}

const char* binStatusName() {
  switch (binStatus) {
    case BIN_OK:      return "OK";
    case BIN_WARNING: return "WARNING";
    case BIN_FULL:    return "FULL";
    case BIN_ERROR:   return "SENSOR_ERROR";
  }
  return "UNKNOWN";
}

/* ======================================================================
 *  TASK 3 - ALERTS
 *   0-74 %    green ON,  red OFF,        buzzer silent
 *   75-89 %   green ON,  red slow blink, buzzer silent
 *   90-100 %  green OFF, red solid,      chirp 200 ms every 2 s
 *   error     green OFF, red fast blink, buzzer silent
 * ==================================================================== */
void taskAlerts(unsigned long now) {
  switch (binStatus) {
    case BIN_OK:
      digitalWrite(PIN_LED_GREEN, HIGH);
      digitalWrite(PIN_LED_RED,   LOW);
      digitalWrite(PIN_BUZZER,    LOW); buzzerOn = false;
      break;

    case BIN_WARNING:
      digitalWrite(PIN_LED_GREEN, HIGH);
      digitalWrite(PIN_LED_RED,   blinkPhase(now, 500) ? HIGH : LOW);
      digitalWrite(PIN_BUZZER,    LOW); buzzerOn = false;
      break;

    case BIN_FULL:
      digitalWrite(PIN_LED_GREEN, LOW);
      digitalWrite(PIN_LED_RED,   HIGH);
      if (!buzzerEnabled) {
        digitalWrite(PIN_BUZZER, LOW); buzzerOn = false;
      } else if (buzzerOn && (now - buzzerChanged >= BEEP_ON_MS)) {
        buzzerOn = false; digitalWrite(PIN_BUZZER, LOW);  buzzerChanged = now;
      } else if (!buzzerOn && (now - buzzerChanged >= BEEP_OFF_MS)) {
        buzzerOn = true;  digitalWrite(PIN_BUZZER, HIGH); buzzerChanged = now;
      }
      break;

    case BIN_ERROR:
      digitalWrite(PIN_LED_GREEN, LOW);
      digitalWrite(PIN_LED_RED,   blinkPhase(now, 150) ? HIGH : LOW);
      digitalWrite(PIN_BUZZER,    LOW); buzzerOn = false;
      break;
  }
}

bool blinkPhase(unsigned long now, unsigned long periodMs) {
  if (now - blinkChanged >= periodMs) { blinkOn = !blinkOn; blinkChanged = now; }
  return blinkOn;
}

/* ======================================================================
 *  TASK 4 - DISPLAY (only compiled when USE_LCD is defined)
 * ==================================================================== */
void taskDisplay() {
#ifdef USE_LCD
  static char line0[17] = "";
  static char line1[17] = "";
  static char prev0[17] = "";
  static char prev1[17] = "";

  snprintf(line0, sizeof(line0), "Lid:%-7s%s", lidStateName(),
           unevenLoad ? "TILT" : (validSensors == 1 ? "1SEN" : "    "));

  /* A locked bin shows LOCKED in place of FULL - locked always means full,
     and it tells the person at the bin WHY the lid ignores them:
     "Fill: 95% LOCKED" is exactly 16 characters. */
  if (binStatus == BIN_ERROR) {
    snprintf(line1, sizeof(line1), "SENSOR ERROR    ");
  } else {
    snprintf(line1, sizeof(line1), "Fill:%3d%% %-6s",
             (int)(fillPercent + 0.5), binLocked() ? "LOCKED" : binStatusName());
  }

  /* Redraw only on change - constant redrawing floods the I2C bus. */
  if (strcmp(line0, prev0) != 0) { lcd.setCursor(0,0); lcd.print(line0); strcpy(prev0, line0); }
  if (strcmp(line1, prev1) != 0) { lcd.setCursor(0,1); lcd.print(line1); strcpy(prev1, line1); }
#endif
}

/* ======================================================================
 *  TASK 5 - TELEMETRY
 *  Also hands a copy of the numbers to the cloud task (when sync is on).
 * ==================================================================== */
void taskTelemetry(unsigned long now) {
  Serial.print(F("["));  Serial.print(now / 1000); Serial.print(F("s] "));

  Serial.print(F("Hand="));
  if (handDistance == INVALID) Serial.print(F("---"));
  else                         Serial.print(handDistance, 1);
  Serial.print(F("cm"));

  Serial.print(F(" | Lid=")); Serial.print(lidStateName());

  Serial.print(F(" | A="));
  if (fillA == INVALID) Serial.print(F("--"));
  else                  Serial.print(fillA, 0);
  Serial.print(F("%"));

  Serial.print(F(" B="));
  if (fillB == INVALID) Serial.print(F("--"));
  else                  Serial.print(fillB, 0);
  Serial.print(F("%"));

  Serial.print(F(" | Fill="));   Serial.print(fillPercent, 0); Serial.print(F("%"));
  Serial.print(F(" | Status=")); Serial.print(binStatusName());
  Serial.print(F(" | Opens="));  Serial.print(openCount);
  if (binLocked())       Serial.print(F(" | LOCKED"));
  if (unevenLoad)        Serial.print(F(" | UNEVEN LOAD"));
  if (validSensors == 1) Serial.print(F(" | DEGRADED 1 SENSOR"));
  Serial.println();

  printBar(fillPercent);

  /* Machine readable line - the website dashboard parses this shape. */
  Serial.println(buildStatusJson());

  cloudPublishSnapshot();
}

void printBar(float percent) {
  int filled = (int)((percent / 100.0) * 20.0 + 0.5);
  Serial.print(F("        ["));
  for (int i = 0; i < 20; i++) Serial.print(i < filled ? "#" : "-");
  Serial.print(F("] "));
  Serial.print(percent, 0);
  Serial.println(F("%"));
}

/* ======================================================================
 *  ULTRASONIC DRIVER
 * ==================================================================== */

/**************************************************************************
 *  readDistanceCm()
 *  1. A 10 microsecond HIGH pulse on TRIG starts a measurement.
 *  2. The sensor emits 8 bursts of 40 kHz ultrasound.
 *  3. ECHO stays HIGH for exactly as long as the sound is travelling.
 *  4. cm = microseconds / 58.31   (0.0343 cm per us, there and back)
 *  Returns -1 when no echo arrives before the timeout.
 **************************************************************************/
float readDistanceCm(int trigPin, int echoPin) {
  digitalWrite(trigPin, LOW);  delayMicroseconds(2);
  digitalWrite(trigPin, HIGH); delayMicroseconds(10);
  digitalWrite(trigPin, LOW);

