SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  unsigned long duration = pulseIn(echoPin, HIGH, ECHO_TIMEOUT_US);
  if (duration == 0) return INVALID;

  float cm = duration / 58.31;
  if (cm < 2.0 || cm > 400.0) return INVALID;   /* outside sensor range */
  return cm;
}

/**************************************************************************
 *  readDistanceMedian()
 *  Three pings, middle value wins. A crumpled bag can bounce one stray
 *  reading; the median discards it without any averaging lag.
 **************************************************************************/
float readDistanceMedian(int trigPin, int echoPin) {
  float a = readDistanceCm(trigPin, echoPin); delay(SENSOR_SETTLE_MS);
  float b = readDistanceCm(trigPin, echoPin); delay(SENSOR_SETTLE_MS);
  float c = readDistanceCm(trigPin, echoPin);

  if (a == INVALID && b == INVALID && c == INVALID) return INVALID;
  if (a == INVALID) a = (b != INVALID) ? b : c;
  if (b == INVALID) b = (c != INVALID) ? c : a;
  if (c == INVALID) c = a;

  float hi = (a > b) ? a : b;
  float lo = (a > b) ? b : a;
  if (c >= hi) return hi;
  if (c <= lo) return lo;
  return c;
}

/* ======================================================================
 *  STARTUP HELPERS
 * ==================================================================== */
void banner() {
  Serial.println();
  Serial.println(F("=================================================="));
  Serial.println(F("   SMART DUSTBIN - EMBEDDED SYSTEM (ESP32)"));
  Serial.print  (F("   Device  : ")); Serial.println(DEVICE_ID);
  Serial.print  (F("   Firmware: v")); Serial.println(FIRMWARE_V);
  Serial.println(F("   Sensors : 1 hand + 2 in-bin level (A and B)"));
  Serial.print  (F("   Bin height     : ")); Serial.print(BIN_HEIGHT_CM, 1);
  Serial.println(F(" cm"));
  Serial.print  (F("   Hand threshold : ")); Serial.print(HAND_DETECT_CM, 1);
  Serial.println(F(" cm"));
  Serial.print  (F("   Warn / Full    : ")); Serial.print(LEVEL_WARN_PERCENT, 0);
  Serial.print  (F(" % / ")); Serial.print(LEVEL_FULL_PERCENT, 0);
  Serial.println(F(" %"));
  Serial.print  (F("   Uneven-load gap: ")); Serial.print(LEVEL_DISAGREE_PCT, 0);
  Serial.println(F(" %"));
  Serial.println(F("   Full lockdown  : ON (crew override: OPEN)"));
  Serial.println(F("=================================================="));
}

/**************************************************************************
 *  selfTest()
 *  Blink every output once so an installer can confirm the wiring at a
 *  glance, then ping all three sensors and report which ones answered.
 *  Shipping products do exactly this on power-up.
 **************************************************************************/
void selfTest() {
  Serial.print(F("Power-on self test ... "));
  digitalWrite(PIN_LED_GREEN, HIGH); delay(250); digitalWrite(PIN_LED_GREEN, LOW);
  digitalWrite(PIN_LED_RED,   HIGH); delay(250); digitalWrite(PIN_LED_RED,   LOW);
  digitalWrite(PIN_BUZZER,    HIGH); delay(150); digitalWrite(PIN_BUZZER,    LOW);
  lidServo.write(ANGLE_OPEN);   delay(500);
  lidServo.write(ANGLE_CLOSED); delay(500);
  Serial.println(F("outputs OK"));

  Serial.print(F("Sensor check: HAND "));
  Serial.print(readDistanceCm(PIN_TRIG_HAND, PIN_ECHO_HAND) == INVALID ? F("no echo") : F("OK"));
  delay(SENSOR_SETTLE_MS);
  Serial.print(F(" | LEVEL-A "));
  Serial.print(readDistanceCm(PIN_TRIG_LEVEL_A, PIN_ECHO_LEVEL_A) == INVALID ? F("no echo") : F("OK"));
  delay(SENSOR_SETTLE_MS);
  Serial.print(F(" | LEVEL-B "));
  Serial.println(readDistanceCm(PIN_TRIG_LEVEL_B, PIN_ECHO_LEVEL_B) == INVALID ? F("no echo") : F("OK"));
}

/**************************************************************************
 *  CLOUD SYNC
 *  ------------------------------------------------------------------------
 *  GOAL: this board shows up live on every dashboard, and obeys commands
 *  queued from them, without any browser ever connecting to the board.
 *  Both sides meet in the middle, in ONE Firestore document:
 *
 *      board --report every 5-60 s--> bins/BIN-001.device     --> dashboards
 *      board <--poll every 10 s------ bins/BIN-001.command    <-- a dashboard
 *      board --acknowledge----------> bins/BIN-001.commandAck --> that dashboard
 *
 *  WHY A SEPARATE RTOS TASK ON CORE 0
 *    One HTTPS request takes 0.5 to 2 s (a TLS handshake plus a round trip
 *    to Google). Done inside loop(), the lid would ignore hands for that
 *    long, several times a minute. The ESP32 has TWO cores and runs
 *    FreeRTOS, so the networking gets its own task, pinned to core 0 - the
 *    core that already runs the Wi-Fi driver - and loop() keeps core 1:
 *
 *        core 1  loop()      sensors, lid, LEDs, LCD, web page   never waits
 *        core 0  cloudTask   sign in, report, poll, acknowledge  may wait
 *
 *    They share data in exactly two ways (section 3a): a snapshot struct
 *    copied under a critical section, and two FreeRTOS queues. The servo is
 *    only ever driven from core 1 - a cloud command is queued, and loop()
 *    applies it with the same applyCommand() the web page and serial use.
 *
 *  NEVER REPLAY A COMMAND AFTER A REBOOT
 *    The first poll after power-up only RECORDS the id of whatever command
 *    is waiting; it does not run it. The board keeps no memory across a
 *    reboot, so it cannot know whether it already obeyed that command -
 *    and an OPEN sent hours ago must not swing the lid open by itself when
 *    the power comes back at 3 a.m. The dashboard sees no acknowledgement
 *    and the operator can simply send it again.
 *
 *  PLAIN REST, NO FIREBASE LIBRARY
 *    Four HTTPS calls and a few indexOf() helpers: nothing to install, and
 *    every byte that goes over the wire is visible in this file. Nothing a
 *    user typed is ever pasted into the JSON we send - only numbers, fixed
 *    words, and a command id that has been checked character by character.
 **************************************************************************/

/* ---- Called by the rest of the sketch - present in BOTH builds -------- */

void cloudBegin() {
#if CLOUD_SYNC
  cloudCmdQueue = xQueueCreate(4, sizeof(CloudCommand));
  cloudAckQueue = xQueueCreate(4, sizeof(CloudAck));
  if (cloudCmdQueue == NULL || cloudAckQueue == NULL) {
    Serial.println(F("Cloud: not enough memory for the queues - sync disabled"));
    return;
  }

  /* 12 KB stack, priority 1 (just above idle), pinned to core 0. */
  if (xTaskCreatePinnedToCore(cloudTask, "cloud", CLOUD_TASK_STACK,
                              NULL, 1, NULL, 0) != pdPASS) {
    Serial.println(F("Cloud: could not start the cloud task - sync disabled"));
    return;
  }
  Serial.print(F("Cloud: sync ON - reporting to Firestore bins/"));
  Serial.println(DEVICE_ID);
#else
  Serial.println(F("Cloud: sync OFF - add secrets.h next to the sketch (copy secrets.example.h) to report to the dashboards"));
#endif
}

/* loop() side: take every command the task has queued, apply it exactly as
   if it had been typed, and hand back the result. Never waits. */
void cloudServiceLoop() {
#if CLOUD_SYNC
  if (cloudCmdQueue == NULL) return;

