SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  CloudCommand c;
  while (xQueueReceive(cloudCmdQueue, &c, 0) == pdTRUE) {   /* 0 = do not wait */
    String result = applyCommand(String(c.cmd));
    Serial.print(F("Cloud: command ")); Serial.print(c.cmd);
    Serial.print(F(" -> "));            Serial.println(result);

    cloudPublishSnapshot();          /* so the acknowledgement carries the NEW state */

    CloudAck a;
    strlcpy(a.id,     c.id,           sizeof(a.id));
    strlcpy(a.result, result.c_str(), sizeof(a.result));
    if (xQueueSend(cloudAckQueue, &a, 0) != pdTRUE) {
      Serial.println(F("Cloud: acknowledgement queue full - ack dropped"));
    }
  }
#endif
}

/* loop() side: copy the numbers the dashboards need into the shared
   snapshot. Built outside the critical section, copied inside it, so the
   other core is held up for a microsecond or two at most. */
void cloudPublishSnapshot() {
#if CLOUD_SYNC
  CloudSnapshot s;
  s.fill    = pctToInt(fillPercent);
  s.fillA   = pctToInt(fillA);        /* -1 = sensor A gave no echo */
  s.fillB   = pctToInt(fillB);
  s.opens   = (int)openCount;
  s.refused = (int)refusedCount;
  s.errors  = (int)errorCount;
  s.sensors = (int)validSensors;
  s.rssi    = (int)WiFi.RSSI();
  s.locked  = binLocked();
  strlcpy(s.lid,    lidStateName(),  sizeof(s.lid));
  strlcpy(s.status, binStatusName(), sizeof(s.status));
  s.valid   = true;

  portENTER_CRITICAL(&cloudMux);
  cloudSnap = s;
  portEXIT_CRITICAL(&cloudMux);
#endif
}

const char* cloudStateText() {
#if CLOUD_SYNC
  bool in;
  portENTER_CRITICAL(&cloudMux);
  in = cloudStat.signedIn;
  portEXIT_CRITICAL(&cloudMux);
  return in ? "on - signed in" : "on - not signed in yet";
#else
  return "off (no secrets.h)";
#endif
}

/* The CLOUD serial command. */
void cloudPrintStatus() {
#if CLOUD_SYNC
  CloudStatus st;
  portENTER_CRITICAL(&cloudMux);
  st = cloudStat;
  portEXIT_CRITICAL(&cloudMux);

  Serial.print(F("Cloud: enabled | project ")); Serial.print(FIREBASE_PROJECT);
  Serial.print(F(" | document bins/"));        Serial.println(DEVICE_ID);
  Serial.print(F("Cloud: signed in: "));       Serial.print(st.signedIn ? F("yes") : F("no"));
  if (st.uid[0]) { Serial.print(F(" (device UID ")); Serial.print(st.uid); Serial.print(F(")")); }
  Serial.println();
  Serial.print(F("Cloud: last push: "));
  if (st.lastPushAt == 0) Serial.print(F("never"));
  else { Serial.print((millis() - st.lastPushAt) / 1000); Serial.print(F(" s ago")); }
  Serial.print(F(" | pushes ")); Serial.print(st.pushes);
  Serial.print(F(" | polls "));  Serial.println(st.polls);
  Serial.print(F("Cloud: last HTTP code: ")); Serial.print(st.lastHttp);
  Serial.print(F(" | last command id: "));    Serial.println(st.lastCmdId[0] ? st.lastCmdId : "(none)");
  Serial.print(F("Cloud: task stack never used: ")); Serial.print(st.stackFree);
  Serial.print(F(" B | free heap: "));             Serial.print(ESP.getFreeHeap());
  Serial.println(F(" B"));
#else
  Serial.println(F("Cloud: disabled - there is no secrets.h next to the sketch (see secrets.example.h)"));
#endif
}

#if CLOUD_SYNC
/* ======================================================================
 *  EVERYTHING BELOW RUNS ON CORE 0, INSIDE cloudTask
 *  These variables are private to that task - loop() never touches them,
 *  so they need no lock.
 * ==================================================================== */
static WiFiClientSecure* cloudTls = NULL;
static String        cloudIdToken;              /* proves who we are, ~1 h life */
static String        cloudRefreshTok;           /* trades for a new idToken     */
static unsigned long cloudTokenAt     = 0;      /* millis() when it arrived     */
static unsigned long cloudTokenLifeMs = 0;
static bool          cloudSignedIn    = false;
static unsigned long cloudRetryAt     = 0;      /* sign-in back-off             */
static unsigned long cloudRetryGap    = 0;
static bool          cloudBaselined   = false;  /* first poll after boot done?  */
static String        cloudLastCmdId;            /* last command id seen         */
static bool          cloudFirstPush   = true;

void cloudTask(void* arg) {
  (void)arg;

  /* TLS client that checks Google's certificate against the built-in
     root bundle. Core 3.x wants the bundle's size; core 2.x does not. */
  cloudTls = new WiFiClientSecure();
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  cloudTls->setCACertBundle(x509_crt_imported_bundle_bin_start,
                            x509_crt_imported_bundle_bin_end - x509_crt_imported_bundle_bin_start);
#else
  cloudTls->setCACertBundle(x509_crt_imported_bundle_bin_start);
#endif
  cloudTls->setHandshakeTimeout(10);         /* seconds */

  CloudSnapshot pushed;                      /* what the cloud holds now */
  memset(&pushed, 0, sizeof(pushed));
  bool          everPushed   = false, attempted = false, lastFailed = false;
  unsigned long lastAttempt  = 0, lastOkAt = 0, lastPollAt = 0;
  bool          polledOnce   = false;
  CloudAck      pending;                     /* an ack waiting to be written */
  bool          hasPending   = false;
  uint8_t       pendingTries = 0;

  for (;;) {
    /* Sleeping here is what lets core 0's idle task run. An RTOS task that
       never blocks starves it, and the task watchdog resets the chip. */
    vTaskDelay(pdMS_TO_TICKS(250));

    if (WiFi.status() != WL_CONNECTED) continue;   /* the driver reconnects itself */
    if (!cloudEnsureToken()) continue;

    unsigned long now = millis();

    /* 1. An acknowledgement from loop()? One at a time. */
    if (!hasPending && xQueueReceive(cloudAckQueue, &pending, 0) == pdTRUE) {
      hasPending   = true;
      pendingTries = 0;
    }

    /* 2. The latest numbers from loop(), copied whole under the lock. */
    CloudSnapshot snap;
    portENTER_CRITICAL(&cloudMux);
    snap = cloudSnap;
    portEXIT_CRITICAL(&cloudMux);

    if (snap.valid) {
      bool changed   = !everPushed ||
                       abs(snap.fill - pushed.fill) >= CLOUD_FILL_STEP ||
                       strcmp(snap.lid,    pushed.lid)    != 0 ||
                       strcmp(snap.status, pushed.status) != 0 ||
                       snap.locked  != pushed.locked ||
                       snap.opens   != pushed.opens  ||
                       snap.refused != pushed.refused;
      bool heartbeat = everPushed && (now - lastOkAt >= CLOUD_HEARTBEAT_MS);
      /* An ack goes out at once - that is what makes PING feel instant.
         Everything else, and every retry after a failure, waits 5 s. */
      bool gapOk     = !attempted || (now - lastAttempt >= CLOUD_MIN_PUSH_MS) ||
                       (hasPending && !lastFailed);

