SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
      if ((changed || heartbeat || hasPending) && gapOk) {
        attempted   = true;
        lastAttempt = now;
        if (cloudCommit(snap, hasPending ? &pending : NULL)) {
          pushed     = snap;
          everPushed = true;
          lastFailed = false;
          lastOkAt   = millis();
          if (hasPending) {
            Serial.printf("Cloud: acknowledged command %s\n", pending.id);
            hasPending = false;
          }
        } else {
          lastFailed = true;
          if (hasPending && ++pendingTries >= 3) {
            Serial.printf("Cloud: gave up acknowledging command %s\n", pending.id);
            hasPending = false;
          }
        }
      }
    }

    /* 3. Has a dashboard queued a command for us? */
    if (!polledOnce || now - lastPollAt >= CLOUD_POLL_MS) {
      polledOnce = true;
      lastPollAt = now;
      cloudPoll();
    }

    /* How much of the stack has never been touched - shown by CLOUD. If
       this ever nears zero, CLOUD_TASK_STACK is too small. */
    uint32_t freeStack = (uint32_t)uxTaskGetStackHighWaterMark(NULL);
    portENTER_CRITICAL(&cloudMux);
    cloudStat.stackFree = freeStack;
    portEXIT_CRITICAL(&cloudMux);
  }
}

/* A valid idToken, or false. Refreshes with 5 minutes to spare, and backs
   off after a failure: hammering Google's endpoints while the network is
   down achieves nothing and gets the account temporarily blocked. */
bool cloudEnsureToken() {
  /* The usual answer: the token we already hold is good for a while yet. */
  if (cloudSignedIn && millis() - cloudTokenAt < cloudTokenLifeMs - CLOUD_TOKEN_SLACK_MS) {
    return true;
  }

  /* EVERYTHING below this line makes an HTTPS request, so it all sits
     behind the back-off gate - the refresh as much as the sign-in. (An
     earlier version gated only the sign-in, so a refresh that kept failing
     was retried forever with no gap at all.) The cast to long makes the
     comparison survive the millis() rollover after 49 days. */
  if (cloudRetryGap > 0 && (long)(millis() - cloudRetryAt) < 0) return false;

  /* Prefer the refresh token - it gets a new hour without sending the
     password again. Fall back to a full sign-in when there is none, or
     when the refresh token has been revoked. */
  bool ok = (cloudSignedIn && cloudRefreshTok.length() > 0 && cloudRefresh()) ||
            cloudSignIn();
  if (ok) { cloudRetryGap = 0; return true; }

  cloudSignedIn = false;
  cloudRetryGap = (cloudRetryGap == 0) ? 15000UL : cloudRetryGap * 2;
  if (cloudRetryGap > 300000UL) cloudRetryGap = 300000UL;   /* cap at 5 min */
  cloudRetryAt  = millis() + cloudRetryGap;
  Serial.printf("Cloud: next sign-in attempt in %lu s\n", cloudRetryGap / 1000);
  return false;
}

/* Firebase Authentication REST: e-mail + password -> idToken. */
bool cloudSignIn() {
  String url  = String("https://identitytoolkit.googleapis.com/v1/accounts:signInWithPassword?key=")
              + FIREBASE_API_KEY;
  String body = String("{\"email\":\"") + jsonEscape(DEVICE_EMAIL) +
                "\",\"password\":\"" + jsonEscape(DEVICE_PASSWORD) +
                "\",\"returnSecureToken\":true}";
  String reply;
  int code = cloudHttp("POST", url, body, "application/json", false, reply);
  body = "";                                  /* do not keep the password in RAM */

  String token = (code == 200) ? jsonStringValue(reply, "idToken", 0) : String("");
  if (token.length() == 0) {
    cloudSignedIn = false;
    portENTER_CRITICAL(&cloudMux);
    cloudStat.signedIn = false;
    portEXIT_CRITICAL(&cloudMux);
    if (code < 0) {
      Serial.printf("Cloud: sign-in failed - network error %d (%s)\n",
                    code, HTTPClient::errorToString(code).c_str());
    } else {
      /* Google's reason is a fixed word such as INVALID_LOGIN_CREDENTIALS. */
      Serial.printf("Cloud: sign-in refused (HTTP %d %s) - check DEVICE_EMAIL and DEVICE_PASSWORD in secrets.h\n",
                    code, jsonStringValue(reply, "message", 0).c_str());
    }
    return false;
  }

  long life        = jsonStringValue(reply, "expiresIn", 0).toInt();   /* "3600" */
  cloudIdToken     = token;
  cloudRefreshTok  = jsonStringValue(reply, "refreshToken", 0);
  cloudTokenLifeMs = (unsigned long)(life >= 600 ? life : 3600) * 1000UL;
  cloudTokenAt     = millis();
  cloudSignedIn    = true;

  String uid = jsonStringValue(reply, "localId", 0);
  portENTER_CRITICAL(&cloudMux);
  cloudStat.signedIn = true;
  strlcpy(cloudStat.uid, uid.c_str(), sizeof(cloudStat.uid));
  portEXIT_CRITICAL(&cloudMux);

  /* The UID is not a secret - the owner needs it to map this board to its bin. */
  Serial.printf("Cloud: signed in - device UID %s (deviceBins() must map it to %s)\n",
                uid.c_str(), DEVICE_ID);
  return true;
}

/* Secure Token REST: refreshToken -> a fresh idToken, with no password. */
bool cloudRefresh() {
  String url  = String("https://securetoken.googleapis.com/v1/token?key=") + FIREBASE_API_KEY;
  /* Refresh tokens only contain URL-safe characters, so no encoding needed. */
  String body = "grant_type=refresh_token&refresh_token=" + cloudRefreshTok;
  String reply;
  int code = cloudHttp("POST", url, body, "application/x-www-form-urlencoded", false, reply);

  String token = (code == 200) ? jsonStringValue(reply, "id_token", 0) : String("");
  if (token.length() == 0) {
    Serial.printf("Cloud: token refresh failed (HTTP %d) - signing in again\n", code);
    return false;
  }
  long   life  = jsonStringValue(reply, "expires_in", 0).toInt();
  String fresh = jsonStringValue(reply, "refresh_token", 0);
  cloudIdToken     = token;
  if (fresh.length() > 0) cloudRefreshTok = fresh;
  cloudTokenLifeMs = (unsigned long)(life >= 600 ? life : 3600) * 1000UL;
  cloudTokenAt     = millis();
  Serial.println(F("Cloud: token refreshed"));
  return true;
}

/* One Firestore commit = one document write: the telemetry, plus the
   acknowledgement when there is one. The server stamps reportedAt / at
   itself (REQUEST_TIME), because the board has no trustworthy clock and
   the rules refuse any time that is not the server's own. */
bool cloudCommit(const CloudSnapshot& s, const CloudAck* ack) {
  /* Every device.* path we write. Keep in step with the fields below. */
  static const char* const DEVICE_FIELDS[] = {
    "fill", "fillA", "fillB", "lid", "status", "locked",
    "opens", "refused", "errors", "sensors", "rssi", "firmware"
  };

