SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
  String b;
  b.reserve(1100);
  b += "{\"writes\":[{\"update\":{\"name\":\"";
  b += cloudDocName();
  b += "\",\"fields\":{\"device\":{\"mapValue\":{\"fields\":{";
  b += fsInt("fill",    s.fill)    + ",";
  b += fsInt("fillA",   s.fillA)   + ",";
  b += fsInt("fillB",   s.fillB)   + ",";
  b += fsStr("lid",     s.lid)     + ",";
  b += fsStr("status",  s.status)  + ",";
  b += fsBool("locked", s.locked)  + ",";
  b += fsInt("opens",   s.opens)   + ",";
  b += fsInt("refused", s.refused) + ",";
  b += fsInt("errors",  s.errors)  + ",";
  b += fsInt("sensors", s.sensors) + ",";
  b += fsInt("rssi",    s.rssi)    + ",";
  b += fsStr("firmware", FIRMWARE_V);
  b += "}}}";
  if (ack) {
    b += ",\"commandAck\":{\"mapValue\":{\"fields\":{";
    b += fsStr("id", ack->id) + "," + fsStr("result", ack->result);
    b += "}}}";
  }
  /* The mask names each leaf, so the rest of the document - the command,
     the dashboards' own fields - is left exactly as it was. */
  b += "}},\"updateMask\":{\"fieldPaths\":[";
  for (size_t i = 0; i < sizeof(DEVICE_FIELDS) / sizeof(DEVICE_FIELDS[0]); i++) {
    if (i > 0) b += ",";
    b += "\"device.";
    b += DEVICE_FIELDS[i];
    b += "\"";
  }
  if (ack) b += ",\"commandAck.id\",\"commandAck.result\"";
  b += "]},\"updateTransforms\":[";
  b += "{\"fieldPath\":\"device.reportedAt\",\"setToServerValue\":\"REQUEST_TIME\"}";
  if (ack) b += ",{\"fieldPath\":\"commandAck.at\",\"setToServerValue\":\"REQUEST_TIME\"}";
  b += "]}]}";

  String url = String("https://firestore.googleapis.com/v1/projects/") + FIREBASE_PROJECT +
               "/databases/(default)/documents:commit";
  String reply;
  if (cloudFirestore("POST", url, b, reply) != 200) return false;

  portENTER_CRITICAL(&cloudMux);
  cloudStat.lastPushAt = millis();
  cloudStat.pushes++;
  portEXIT_CRITICAL(&cloudMux);

  if (cloudFirstPush) {
    cloudFirstPush = false;
    Serial.printf("Cloud: first report written - %s is now live on the dashboards\n", DEVICE_ID);
  }
  return true;
}

/* Reads ONLY the command field (mask.fieldPaths) - one small read. */
void cloudPoll() {
  String url = String("https://firestore.googleapis.com/v1/") + cloudDocName() +
               "?mask.fieldPaths=command";
  String reply;
  int code = cloudFirestore("GET", url, String(), reply);
  if (code != 200 && code != 404) return;          /* try again next time */

  portENTER_CRITICAL(&cloudMux);
  cloudStat.polls++;
  portEXIT_CRITICAL(&cloudMux);

  String cmd, id;
  int at = (code == 200) ? reply.indexOf("\"command\"") : -1;
  if (at >= 0) {
    cmd = firestoreString(reply, "cmd", at);
    id  = firestoreString(reply, "id",  at);
    cmd.toUpperCase();
  }

  /* First good poll since boot: remember, never replay (see banner above). */
  if (!cloudBaselined) {
    cloudBaselined = true;
    cloudLastCmdId = id;
    if (id.length() > 0 && cloudIdIsSafe(id)) {
      portENTER_CRITICAL(&cloudMux);
      strlcpy(cloudStat.lastCmdId, id.c_str(), sizeof(cloudStat.lastCmdId));
      portEXIT_CRITICAL(&cloudMux);
      Serial.printf("Cloud: command id %s was already waiting at boot - recorded, NOT replayed\n",
                    id.c_str());
    }
    Serial.println(F("Cloud: listening for dashboard commands every 10 s"));
    return;
  }

  if (id.length() == 0 || id == cloudLastCmdId) return;    /* nothing new */
  cloudLastCmdId = id;

  /* The id is the one thing we echo back, so it must be plain letters,
     digits, '-' or '_'. Anything else is dropped, not escaped. */
  if (!cloudIdIsSafe(id)) {
    Serial.println(F("Cloud: ignored a command with a malformed id"));
    return;
  }
  portENTER_CRITICAL(&cloudMux);
  strlcpy(cloudStat.lastCmdId, id.c_str(), sizeof(cloudStat.lastCmdId));
  portEXIT_CRITICAL(&cloudMux);

  if (!cloudCmdAllowed(cmd)) {
    Serial.printf("Cloud: command id %s refused - not one of OPEN CLOSE AUTO MUTE UNMUTE EMPTY PING\n",
                  id.c_str());
    CloudAck a;
    strlcpy(a.id,     id.c_str(),                      sizeof(a.id));
    strlcpy(a.result, "refused - command not allowed", sizeof(a.result));
    xQueueSend(cloudAckQueue, &a, 0);
    return;
  }

  CloudCommand c;
  strlcpy(c.cmd, cmd.c_str(), sizeof(c.cmd));
  strlcpy(c.id,  id.c_str(),  sizeof(c.id));
  if (xQueueSend(cloudCmdQueue, &c, 0) != pdTRUE) {
    Serial.println(F("Cloud: command queue full - command dropped"));
  }
}

/* One HTTPS request. Returns the HTTP status, or a negative HTTPClient
   error when the network failed. Blocks for up to ~5 s - which is exactly
   why it only ever runs on the cloud task, never in loop(). */
int cloudHttp(const char* method, const String& url, const String& body,
              const char* contentType, bool withToken, String& reply) {
  HTTPClient http;
  reply = "";
  http.setReuse(false);                      /* one request, one connection */
  http.setConnectTimeout(5000);
  http.setTimeout(5000);
  if (!http.begin(*cloudTls, url)) return HTTPC_ERROR_CONNECTION_REFUSED;
  if (contentType) http.addHeader("Content-Type", contentType);
  if (withToken)   http.addHeader("Authorization", "Bearer " + cloudIdToken);

  int code = (strcmp(method, "GET") == 0) ? http.GET() : http.sendRequest(method, body);
  if (code > 0) reply = http.getString();
  http.end();
  return code;
}

/* A Firestore request with the token attached. On 401 (token no longer
   accepted) it signs in again and retries - once. */
int cloudFirestore(const char* method, const String& url, const String& body,
                   String& reply) {
  const char* type = (strcmp(method, "GET") == 0) ? NULL : "application/json";
  int code = cloudHttp(method, url, body, type, true, reply);
  if (code == 401) {
    Serial.println(F("Cloud: 401 - token rejected, signing in again"));
    cloudSignedIn = false;
    if (cloudSignIn()) code = cloudHttp(method, url, body, type, true, reply);
  }
  cloudNoteHttp(code, reply);
  return code;
}

/* Records the result for the CLOUD command, and explains a failure ONCE,
   when the code changes, instead of every 10 seconds. */
void cloudNoteHttp(int code, const String& reply) {
  int prev;
  portENTER_CRITICAL(&cloudMux);
  prev = cloudStat.lastHttp;
  cloudStat.lastHttp = code;
  portEXIT_CRITICAL(&cloudMux);
  if (code == prev) return;

  if (code == 200) {
    Serial.println(F("Cloud: HTTP 200 - Firestore accepted the request"));
  } else if (code == 403) {
    Serial.println(F("Cloud: 403 - rules not published, or this device's UID is not in deviceBins()"));
  } else if (code == 404) {
    /* polling before the first report created the document - harmless */
  } else if (code < 0) {
    Serial.printf("Cloud: network error %d (%s) - will retry\n",
                  code, HTTPClient::errorToString(code).c_str());
  } else {
    Serial.printf("Cloud: HTTP %d %s\n", code, jsonStringValue(reply, "message", 0).c_str());
  }
}

