SNischayPrasad/Smart-Dustbin-Embedded-System/arduino_code/05_esp32_wifi_version/05_esp32_wifi_version.ino
/* ---- Small helpers --------------------------------------------------- */

String cloudDocName() {
  return String("projects/") + FIREBASE_PROJECT + "/databases/(default)/documents/bins/" + DEVICE_ID;
}

/* Finds "key": "value" in a JSON reply and returns value. Google pretty-
   prints its replies, so spaces and newlines around the colon are skipped.
   This is NOT a general JSON parser - it reads the few flat, known replies
   used here, and returns "" for anything unexpected. */
String jsonStringValue(const String& body, const char* key, int from) {
  String pat = String("\"") + key + "\"";
  int i = body.indexOf(pat, from);
  if (i < 0) return "";
  int n = (int)body.length();
  i += pat.length();
  while (i < n && isspace((unsigned char)body[i])) i++;
  if (i >= n || body[i] != ':') return "";
  i++;
  while (i < n && isspace((unsigned char)body[i])) i++;
  if (i >= n || body[i] != '"') return "";   /* not a string value */
  int end = body.indexOf('"', i + 1);
  if (end < 0) return "";
  return body.substring(i + 1, end);
}

/* Firestore wraps every value in its type:  "cmd": { "stringValue": "OPEN" }.
   Returns the string, or "" when the key is missing or is not a string. */
String firestoreString(const String& body, const char* key, int from) {
  String pat = String("\"") + key + "\"";
  int k = body.indexOf(pat, from);
  if (k < 0) return "";
  int close = body.indexOf('}', k);
  int sv    = body.indexOf("\"stringValue\"", k);
  if (sv < 0 || (close >= 0 && sv > close)) return "";   /* belongs to another key */
  return jsonStringValue(body, "stringValue", sv);
}

/* Only for DEVICE_EMAIL / DEVICE_PASSWORD, which the owner typed into
   secrets.h - a quote or backslash in a password must not break the JSON. */
String jsonEscape(const char* s) {
  String out;
  for (; *s; s++) {
    if (*s == '"' || *s == '\\') out += '\\';
    if ((unsigned char)*s >= 0x20) out += *s;
  }
  return out;
}

/* Firestore's typed JSON. integerValue is a STRING on purpose: JSON numbers
   cannot hold every 64-bit integer, so Firestore sends them as text. */
String fsInt(const char* key, int v) {
  return String("\"") + key + "\":{\"integerValue\":\"" + String(v) + "\"}";
}
String fsStr(const char* key, const char* v) {   /* v: fixed words and checked ids only */
  return String("\"") + key + "\":{\"stringValue\":\"" + v + "\"}";
}
String fsBool(const char* key, bool v) {
  return String("\"") + key + "\":{\"booleanValue\":" + (v ? "true" : "false") + "}";
}

bool cloudIdIsSafe(const String& id) {
  if (id.length() == 0 || id.length() > 40) return false;
  for (unsigned int i = 0; i < id.length(); i++) {
    char c = id[i];
    if (!isalnum((unsigned char)c) && c != '-' && c != '_') return false;
  }
  return true;
}

/* The only commands the cloud may send. STATUS / HELP / WIFI / CLOUD are
   for a person at the serial port, not for a remote dashboard. */
bool cloudCmdAllowed(const String& cmd) {
  return cmd == "OPEN"   || cmd == "CLOSE" || cmd == "AUTO" || cmd == "MUTE" ||
         cmd == "UNMUTE" || cmd == "EMPTY" || cmd == "PING";
}
#endif  /* CLOUD_SYNC */
